results/memdisk-fullretest-128g-20260710/B/fio-seqread.txt
seqread: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
seqread: Laying out IO file (1 file / 4096MiB)

seqread: (groupid=0, jobs=1): err= 0: pid=2603354: Fri Jul 10 14:58:53 2026
  read: IOPS=274, BW=68.6MiB/s (71.9MB/s)(4096MiB/59741msec)
    clat (usec): min=125, max=11713, avg=3641.84, stdev=2090.31
     lat (usec): min=125, max=11714, avg=3642.28, stdev=2090.27
    clat percentiles (usec):
     |  1.00th=[  206],  5.00th=[  449], 10.00th=[ 1029], 20.00th=[ 1729],
     | 30.00th=[ 2245], 40.00th=[ 2868], 50.00th=[ 3294], 60.00th=[ 4113],
     | 70.00th=[ 4817], 80.00th=[ 5473], 90.00th=[ 6652], 95.00th=[ 7439],
     | 99.00th=[ 8356], 99.50th=[ 8717], 99.90th=[ 9241], 99.95th=[ 9503],
     | 99.99th=[11600]
   bw (  KiB/s): min=66048, max=74240, per=100.00%, avg=70233.23, stdev=1574.99, samples=119
   iops        : min=  258, max=  290, avg=274.34, stdev= 6.16, samples=119
  lat (usec)   : 250=2.52%, 500=2.85%, 750=1.64%, 1000=2.58%
  lat (msec)   : 2=14.03%, 4=35.02%, 10=41.33%, 20=0.03%
  cpu          : usr=0.26%, sys=6.83%, ctx=24592, majf=0, minf=134
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=16384,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=68.6MiB/s (71.9MB/s), 68.6MiB/s-68.6MiB/s (71.9MB/s-71.9MB/s), io=4096MiB (4295MB), run=59741-59741msec